espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/se_manager/src/sl_se_manager_hash.c
  if (cmd_ctx == NULL || sha256_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sha256_ctx->total[0] = 0;
  sha256_ctx->total[1] = 0;
  memcpy(sha256_ctx->state, init_state_sha256, sizeof(sha256_ctx->state));

  sha256_ctx->hash_type = SL_SE_HASH_SHA256;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Start a SHA256 stream operation. Deprecated.
 ******************************************************************************/
sl_status_t
sl_se_hash_sha256_starts(sl_se_hash_streaming_context_t *hash_ctx,
                         sl_se_command_context_t *cmd_ctx,
                         sl_se_sha256_streaming_context_t *sha256_ctx)
{
  if (hash_ctx == NULL || cmd_ctx == NULL || sha256_ctx == NULL ) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  hash_ctx->cmd_ctx = cmd_ctx;

  sl_se_sha256_multipart_context_t sha256_ctx_multi;

  sl_status_t status = sl_se_hash_sha256_multipart_starts(&sha256_ctx_multi, hash_ctx->cmd_ctx);

  if (status != SL_STATUS_OK) {
    return status;
  }
  memcpy(sha256_ctx->total, sha256_ctx_multi.total, sizeof(sha256_ctx->total));
  memcpy(sha256_ctx->state, sha256_ctx_multi.state, sizeof(sha256_ctx->state));

  hash_ctx->hash_type = SL_SE_HASH_SHA256;
  hash_ctx->hash_type_ctx = sha256_ctx;

  return SL_STATUS_OK;
}

#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
/***************************************************************************//**
 * Start a SHA384 stream operation.
 ******************************************************************************/
sl_status_t
sl_se_hash_sha384_multipart_starts(sl_se_sha384_multipart_context_t *sha384_ctx,
                                   sl_se_command_context_t *cmd_ctx)
{
  static const uint8_t init_state_sha384[64] = {
    0xCB, 0xBB, 0x9D, 0x5D, 0xC1, 0x05, 0x9E, 0xD8,
    0x62, 0x9A, 0x29, 0x2A, 0x36, 0x7C, 0xD5, 0x07,
    0x91, 0x59, 0x01, 0x5A, 0x30, 0x70, 0xDD, 0x17,
    0x15, 0x2F, 0xEC, 0xD8, 0xF7, 0x0E, 0x59, 0x39,
    0x67, 0x33, 0x26, 0x67, 0xFF, 0xC0, 0x0B, 0x31,
    0x8E, 0xB4, 0x4A, 0x87, 0x68, 0x58, 0x15, 0x11,
    0xDB, 0x0C, 0x2E, 0x0D, 0x64, 0xF9, 0x8F, 0xA7,
    0x47, 0xB5, 0x48, 0x1D, 0xBE, 0xFA, 0x4F, 0xA4
  };

  if (cmd_ctx == NULL || sha384_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sha384_ctx->total[0] = 0;
  sha384_ctx->total[1] = 0;
  sha384_ctx->total[2] = 0;
  sha384_ctx->total[3] = 0;
  memcpy(sha384_ctx->state, init_state_sha384, sizeof(sha384_ctx->state));

  sha384_ctx->hash_type = SL_SE_HASH_SHA384;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Start a SHA384 stream operation. Deprecated.
 ******************************************************************************/
sl_status_t
sl_se_hash_sha384_starts(sl_se_hash_streaming_context_t *hash_ctx,
                         sl_se_command_context_t *cmd_ctx,
                         sl_se_sha384_streaming_context_t *sha384_ctx)
{
  if (hash_ctx == NULL || cmd_ctx == NULL || sha384_ctx == NULL ) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  hash_ctx->cmd_ctx = cmd_ctx;

  sl_se_sha384_multipart_context_t sha384_ctx_multi;

  sl_status_t status = sl_se_hash_sha384_multipart_starts(&sha384_ctx_multi, hash_ctx->cmd_ctx);
  if (status != SL_STATUS_OK) {
    return status;
  }

  memcpy(sha384_ctx->total, sha384_ctx_multi.total, sizeof(sha384_ctx->total));
  memcpy(sha384_ctx->state, sha384_ctx_multi.state, sizeof(sha384_ctx->state));

  hash_ctx->hash_type = SL_SE_HASH_SHA384;
  hash_ctx->hash_type_ctx = sha384_ctx;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Start a SHA512 stream operation.
 ******************************************************************************/
sl_status_t
sl_se_hash_sha512_multipart_starts(sl_se_sha512_multipart_context_t *sha512_ctx, sl_se_command_context_t *cmd_ctx)
{
  static const uint8_t init_state_sha512[64] = {
    0x6A, 0x09, 0xE6, 0x67, 0xF3, 0xBC, 0xC9, 0x08,
    0xBB, 0x67, 0xAE, 0x85, 0x84, 0xCA, 0xA7, 0x3B,
    0x3C, 0x6E, 0xF3, 0x72, 0xFE, 0x94, 0xF8, 0x2B,
    0xA5, 0x4F, 0xF5, 0x3A, 0x5F, 0x1D, 0x36, 0xF1,
    0x51, 0x0E, 0x52, 0x7F, 0xAD, 0xE6, 0x82, 0xD1,
    0x9B, 0x05, 0x68, 0x8C, 0x2B, 0x3E, 0x6C, 0x1F,
    0x1F, 0x83, 0xD9, 0xAB, 0xFB, 0x41, 0xBD, 0x6B,
    0x5B, 0xE0, 0xCD, 0x19, 0x13, 0x7E, 0x21, 0x79
  };

  if (cmd_ctx == NULL || sha512_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sha512_ctx->total[0] = 0;
  sha512_ctx->total[1] = 0;
  sha512_ctx->total[2] = 0;
  sha512_ctx->total[3] = 0;
  memcpy(sha512_ctx->state, init_state_sha512, sizeof(sha512_ctx->state));

  sha512_ctx->hash_type = SL_SE_HASH_SHA512;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 * Start a SHA512 stream operation. Deprecated.
 ******************************************************************************/
sl_status_t
sl_se_hash_sha512_starts(sl_se_hash_streaming_context_t *hash_ctx,
                         sl_se_command_context_t *cmd_ctx,
                         sl_se_sha512_streaming_context_t *sha512_ctx)
{
  if (hash_ctx == NULL || cmd_ctx == NULL || sha512_ctx == NULL ) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  hash_ctx->cmd_ctx = cmd_ctx;

  sl_se_sha512_multipart_context_t sha512_ctx_multi;

  sl_status_t status = sl_se_hash_sha512_multipart_starts(&sha512_ctx_multi, hash_ctx->cmd_ctx);
  if (status != SL_STATUS_OK) {
    return SL_STATUS_INVALID_PARAMETER;
  }
  memcpy(sha512_ctx->total, sha512_ctx_multi.total, sizeof(sha512_ctx->total));
  memcpy(sha512_ctx->state, sha512_ctx_multi.state, sizeof(sha512_ctx->state));

  hash_ctx->hash_type = SL_SE_HASH_SHA512;
  hash_ctx->hash_type_ctx = sha512_ctx;

  return SL_STATUS_OK;
}

#endif

/***************************************************************************//**
 * Start a hash stream operation.
 ******************************************************************************/
sl_status_t sl_se_hash_multipart_starts(void *hash_type_ctx,
                                        sl_se_command_context_t *cmd_ctx,
                                        sl_se_hash_type_t hash_type)
{
  if (cmd_ctx == NULL || hash_type_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  switch (hash_type) {
    case SL_SE_HASH_SHA1:
      return sl_se_hash_sha1_multipart_starts((sl_se_sha1_multipart_context_t*)
                                              hash_type_ctx, cmd_ctx);

    case SL_SE_HASH_SHA224:
      return sl_se_hash_sha224_multipart_starts((sl_se_sha224_multipart_context_t*)
                                                hash_type_ctx, cmd_ctx);

