espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/se_manager/src/sl_se_manager_hash.c
    case SL_SE_HASH_SHA256:
      return sl_se_hash_sha256_multipart_starts((sl_se_sha256_multipart_context_t*)
                                                hash_type_ctx, cmd_ctx);

#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
      return sl_se_hash_sha384_multipart_starts((sl_se_sha384_multipart_context_t*)
                                                hash_type_ctx,
                                                cmd_ctx);

    case SL_SE_HASH_SHA512:
      return sl_se_hash_sha512_multipart_starts((sl_se_sha512_multipart_context_t*)
                                                hash_type_ctx, cmd_ctx);
#endif

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }
}

/***************************************************************************//**
 * Start a hash stream operation. Deprecated.
 ******************************************************************************/
sl_status_t sl_se_hash_starts(sl_se_hash_streaming_context_t *hash_ctx,
                              sl_se_command_context_t *cmd_ctx,
                              sl_se_hash_type_t hash_type,
                              void *hash_type_ctx)
{
  if (hash_ctx == NULL || cmd_ctx == NULL || hash_type_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  switch (hash_type) {
    case SL_SE_HASH_SHA1:
      return sl_se_hash_sha1_starts(hash_ctx,
                                    cmd_ctx,
                                    (sl_se_sha1_streaming_context_t*)
                                    hash_type_ctx);

    case SL_SE_HASH_SHA224:
      return sl_se_hash_sha224_starts(hash_ctx,
                                      cmd_ctx,
                                      (sl_se_sha224_streaming_context_t*)
                                      hash_type_ctx);

    case SL_SE_HASH_SHA256:
      return sl_se_hash_sha256_starts(hash_ctx,
                                      cmd_ctx,
                                      (sl_se_sha256_streaming_context_t*)
                                      hash_type_ctx);
#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
      return sl_se_hash_sha384_starts(hash_ctx,
                                      cmd_ctx,
                                      (sl_se_sha384_streaming_context_t*)
                                      hash_type_ctx);

    case SL_SE_HASH_SHA512:
      return sl_se_hash_sha512_starts(hash_ctx,
                                      cmd_ctx,
                                      (sl_se_sha512_streaming_context_t*)
                                      hash_type_ctx);
#endif

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }
}

/***************************************************************************//**
 *   Feeds an input block into an ongoing hash computation.
 ******************************************************************************/
static sl_status_t se_cmd_hash_multipart_update(void *hash_type_ctx,
                                                sl_se_command_context_t *cmd_ctx,
                                                const uint8_t *input,
                                                uint32_t num_blocks)
{
  SE_Command_t *se_cmd = &cmd_ctx->command;
  uint32_t command_word;
  unsigned int ilen, state_len;
  uint8_t *state;

  switch (((sl_se_sha1_multipart_context_t*)hash_type_ctx)->hash_type) {
    case SL_SE_HASH_SHA1:
      command_word = SE_COMMAND_HASHUPDATE | SE_COMMAND_OPTION_HASH_SHA1;
      // SHA1 block size is 64 bytes
      ilen = 64 * num_blocks;
      // SHA1 state size is 20 bytes
      state_len = 20;
      state = ((sl_se_sha1_multipart_context_t*)hash_type_ctx)->state;
      break;

    case SL_SE_HASH_SHA224:
      command_word = SE_COMMAND_HASHUPDATE | SE_COMMAND_OPTION_HASH_SHA224;
      // SHA224 block size is 64 bytes
      ilen = 64 * num_blocks;
      // SHA224 state size is 32 bytes
      state_len = 32;
      state = ((sl_se_sha224_multipart_context_t*)hash_type_ctx)->state;
      break;

    case SL_SE_HASH_SHA256:
      command_word = SE_COMMAND_HASHUPDATE | SE_COMMAND_OPTION_HASH_SHA256;
      // SHA256 block size is 64 bytes
      ilen = 64 * num_blocks;
      // SHA256 state size is 32 bytes
      state_len = 32;
      state = ((sl_se_sha256_multipart_context_t*)hash_type_ctx)->state;
      break;

#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
      command_word = SE_COMMAND_HASHUPDATE | SE_COMMAND_OPTION_HASH_SHA384;
      // SHA384 block size is 128 bytes
      ilen = 128 * num_blocks;
      // SHA384 state size is 64 bytes
      state_len = 64;
      state = ((sl_se_sha384_multipart_context_t*)hash_type_ctx)->state;
      break;

    case SL_SE_HASH_SHA512:
      command_word = SE_COMMAND_HASHUPDATE | SE_COMMAND_OPTION_HASH_SHA512;
      // SHA512 block size is 128 bytes
      ilen = 128 * num_blocks;
      // SHA512 state size is 64 bytes
      state_len = 64;
      state = ((sl_se_sha512_multipart_context_t*)hash_type_ctx)->state;
      break;
#endif

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  sli_se_command_init(cmd_ctx, command_word);

  SE_addParameter(se_cmd, ilen);

  SE_DataTransfer_t data_in = SE_DATATRANSFER_DEFAULT(input, ilen);
  SE_DataTransfer_t iv_in = SE_DATATRANSFER_DEFAULT(state, state_len);
  SE_DataTransfer_t iv_out = SE_DATATRANSFER_DEFAULT(state, state_len);

  SE_addDataInput(se_cmd, &iv_in);
  SE_addDataInput(se_cmd, &data_in);
  SE_addDataOutput(se_cmd, &iv_out);

  // Execute and wait
  return sli_se_execute_and_wait(cmd_ctx);
}

/***************************************************************************//**
 *   Feeds an input buffer into an ongoing hash computation.
 ******************************************************************************/
sl_status_t sl_se_hash_multipart_update(void *hash_type_ctx,
                                        sl_se_command_context_t *cmd_ctx,
                                        const uint8_t *input,
                                        size_t input_len)
{
  size_t blocksize, countersize, blocks, fill, left;
  uint32_t *counter;
  uint8_t *buffer;
  sl_status_t status;

