espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/se_manager/src/sl_se_manager_hash.c
  if ( input_len == 0 ) {
    return SL_STATUS_OK;
  }

  if (hash_type_ctx == NULL || cmd_ctx == NULL || input == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  switch (((sl_se_sha1_multipart_context_t*)hash_type_ctx)->hash_type) {
    case SL_SE_HASH_SHA1:
      blocksize = 64;
      countersize = 64 / 32;
      counter = ((sl_se_sha1_multipart_context_t*)hash_type_ctx)->total;
      buffer = ((sl_se_sha1_multipart_context_t*)hash_type_ctx)->buffer;
      break;

    case SL_SE_HASH_SHA224:
      blocksize = 64;
      countersize = 64 / 32;
      counter = ((sl_se_sha224_multipart_context_t*)hash_type_ctx)->total;
      buffer = ((sl_se_sha224_multipart_context_t*)hash_type_ctx)->buffer;
      break;

    case SL_SE_HASH_SHA256:
      blocksize = 64;
      countersize = 64 / 32;
      counter = ((sl_se_sha256_multipart_context_t*)hash_type_ctx)->total;
      buffer = ((sl_se_sha256_multipart_context_t*)hash_type_ctx)->buffer;
      break;

#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
      blocksize = 128;
      countersize = 128 / 32;
      counter = ((sl_se_sha384_multipart_context_t*)hash_type_ctx)->total;
      buffer = ((sl_se_sha384_multipart_context_t*)hash_type_ctx)->buffer;
      break;

    case SL_SE_HASH_SHA512:
      blocksize = 128;
      countersize = 128 / 32;
      counter = ((sl_se_sha512_multipart_context_t*)hash_type_ctx)->total;
      buffer = ((sl_se_sha512_multipart_context_t*)hash_type_ctx)->buffer;
      break;
#endif

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  left = (counter[0] & (blocksize - 1));
  fill = blocksize - left;

  counter[0] += input_len;

  // ripple counter
  if ( counter[0] < input_len ) {
    counter[1] += 1;
#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    for (size_t i = 1; i < (countersize - 1); i++) {
      if ( counter[i] == 0 ) {
        counter[i + 1]++;
      }
    }
#else
    (void)countersize;
#endif
  }

  if ( (left > 0) && (input_len >= fill) ) {
    memcpy( (void *) (buffer + left), input, fill);
    status = se_cmd_hash_multipart_update(hash_type_ctx, cmd_ctx, buffer, 1);
    if (status != SL_STATUS_OK) {
      return status;
    }
    input += fill;
    input_len -= fill;
    left = 0;
  }

  if ( input_len >= blocksize ) {
    blocks = input_len / blocksize;
    status = se_cmd_hash_multipart_update(hash_type_ctx, cmd_ctx, input, blocks);
    if (status != SL_STATUS_OK) {
      return status;
    }
    input += blocksize * blocks;
    input_len -= blocksize * blocks;
  }

  if ( input_len > 0 ) {
    memcpy( (void *) (buffer + left), input, input_len);
  }

  return SL_STATUS_OK;
}
/***************************************************************************//**
 *   Feeds an input buffer into an ongoing hash computation. Deprecated.
 ******************************************************************************/
sl_status_t sl_se_hash_update(sl_se_hash_streaming_context_t *hash_ctx,
                              const uint8_t *input,
                              size_t input_len)

{
  if (hash_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  switch (hash_ctx->hash_type) {
    case SL_SE_HASH_SHA1:
    {
      sl_se_sha1_multipart_context_t hash_type_ctx_multi;

      memcpy(hash_type_ctx_multi.total, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = SL_SE_HASH_SHA1;
      sl_status_t status =  sl_se_hash_multipart_update((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, input, input_len);
      if (status != SL_STATUS_OK) {
        return status;
      }
      memcpy(((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->total, hash_type_ctx_multi.total, sizeof(hash_type_ctx_multi.total));
      memcpy(((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, hash_type_ctx_multi.buffer, sizeof(hash_type_ctx_multi.buffer));
      memcpy(((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->state, hash_type_ctx_multi.state, sizeof(hash_type_ctx_multi.state));
      break;
    }
    case SL_SE_HASH_SHA224:
    {
      sl_se_sha224_multipart_context_t hash_type_ctx_multi;
      memcpy(hash_type_ctx_multi.total, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = SL_SE_HASH_SHA224;
      sl_status_t status = sl_se_hash_multipart_update((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, input, input_len);
      if (status != SL_STATUS_OK) {
        return status;
      }
      memcpy(((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->total, hash_type_ctx_multi.total, sizeof(hash_type_ctx_multi.total));
      memcpy(((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, hash_type_ctx_multi.buffer, sizeof(hash_type_ctx_multi.buffer));
      memcpy(((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->state, hash_type_ctx_multi.state, sizeof(hash_type_ctx_multi.state));

      break;
    }
    case SL_SE_HASH_SHA256:
    {
      sl_se_sha256_multipart_context_t hash_type_ctx_multi;

      memcpy(hash_type_ctx_multi.total, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = SL_SE_HASH_SHA256;
      sl_status_t status =  sl_se_hash_multipart_update((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, input, input_len);
      if (status != SL_STATUS_OK) {
        return status;
      }
      memcpy(((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->total, hash_type_ctx_multi.total, sizeof(hash_type_ctx_multi.total));
      memcpy(((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, hash_type_ctx_multi.buffer, sizeof(hash_type_ctx_multi.buffer));
      memcpy(((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->state, hash_type_ctx_multi.state, sizeof(hash_type_ctx_multi.state));
      break;
    }

#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
    {
      sl_se_sha384_multipart_context_t hash_type_ctx_multi;

