espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/se_manager/src/sl_se_manager_hash.c
  sl_status_t status = sl_se_hash_multipart_update(hash_type_ctx, cmd_ctx, sha_padding, num_pad_bytes);

  if (status == SL_STATUS_OK) {
    status = sl_se_hash_multipart_update(hash_type_ctx, cmd_ctx, msglen, countersize * 4);
  }

  if (status == SL_STATUS_OK) {
    memcpy(digest_out, state, outputsize);
  }

  return status;
}

/***************************************************************************//**
 *   Finish an ongoing hash streaming computation. Deprecated.
 ******************************************************************************/
sl_status_t sl_se_hash_finish(sl_se_hash_streaming_context_t *hash_ctx,
                              uint8_t *digest_out,
                              size_t   digest_len)
{
  if (hash_ctx == NULL) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  switch (hash_ctx->hash_type) {
    case SL_SE_HASH_SHA1:
    {
      sl_se_sha1_multipart_context_t hash_type_ctx_multi;
      memcpy(hash_type_ctx_multi.total, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha1_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));

      hash_type_ctx_multi.hash_type = SL_SE_HASH_SHA1;
      return sl_se_hash_multipart_finish((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, digest_out, digest_len);
      break;
    }
    case SL_SE_HASH_SHA224:
    {
      sl_se_sha224_multipart_context_t hash_type_ctx_multi;
      memcpy(hash_type_ctx_multi.total, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha224_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = hash_ctx->hash_type;
      return sl_se_hash_multipart_finish((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, digest_out, digest_len);

      break;
    }
    case SL_SE_HASH_SHA256:
    {
      sl_se_sha256_multipart_context_t hash_type_ctx_multi;

      memcpy(hash_type_ctx_multi.total, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha256_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = hash_ctx->hash_type;
      return sl_se_hash_multipart_finish((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, digest_out, digest_len);

      break;
    }
#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
    {
      sl_se_sha384_multipart_context_t hash_type_ctx_multi;

      memcpy(hash_type_ctx_multi.total, ((sl_se_sha384_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha384_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha384_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = hash_ctx->hash_type;
      return sl_se_hash_multipart_finish((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, digest_out, digest_len);

      break;
    }
    case SL_SE_HASH_SHA512:
    {
      sl_se_sha512_multipart_context_t hash_type_ctx_multi;

      memcpy(hash_type_ctx_multi.total, ((sl_se_sha512_streaming_context_t*)hash_ctx->hash_type_ctx)->total, sizeof(hash_type_ctx_multi.total));
      memcpy(hash_type_ctx_multi.state, ((sl_se_sha512_streaming_context_t*)hash_ctx->hash_type_ctx)->state, sizeof(hash_type_ctx_multi.state));
      memcpy(hash_type_ctx_multi.buffer, ((sl_se_sha512_streaming_context_t*)hash_ctx->hash_type_ctx)->buffer, sizeof(hash_type_ctx_multi.buffer));
      hash_type_ctx_multi.hash_type = hash_ctx->hash_type;
      return sl_se_hash_multipart_finish((void*)&hash_type_ctx_multi, hash_ctx->cmd_ctx, digest_out, digest_len);
      break;
    }
  #endif

    default:
      return SL_STATUS_INVALID_PARAMETER;
  }
}

/***************************************************************************//**
 *   Produce a message digest (a hash block) using the input data.
 ******************************************************************************/
sl_status_t sl_se_hash(sl_se_command_context_t *cmd_ctx,
                       sl_se_hash_type_t hash_type,
                       const uint8_t *message,
                       unsigned int message_size,
                       uint8_t* digest,
                       size_t digest_len)
{
  if (cmd_ctx == NULL
      || digest == NULL
      || (message == NULL
          && message_size != 0)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  SE_Command_t *se_cmd = &cmd_ctx->command;
  uint32_t command_word = SE_COMMAND_HASH;
  uint32_t digest_size = 0;

  switch (hash_type) {
    case SL_SE_HASH_SHA1:
      command_word |= SE_COMMAND_OPTION_HASH_SHA1;
      digest_size = 20;
      break;
    case SL_SE_HASH_SHA224:
      command_word |= SE_COMMAND_OPTION_HASH_SHA224;
      digest_size = 28;
      break;
    case SL_SE_HASH_SHA256:
      command_word |= SE_COMMAND_OPTION_HASH_SHA256;
      digest_size = 32;
      break;
#if (_SILICON_LABS_SECURITY_FEATURE == _SILICON_LABS_SECURITY_FEATURE_VAULT)
    case SL_SE_HASH_SHA384:
      command_word |= SE_COMMAND_OPTION_HASH_SHA384;
      digest_size = 48;
      break;
    case SL_SE_HASH_SHA512:
      digest_size = 64;
      command_word |= SE_COMMAND_OPTION_HASH_SHA512;
      break;
#endif
    default:
      return SL_STATUS_INVALID_PARAMETER;
  }

  if ( digest_len < digest_size ) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  sli_se_command_init(cmd_ctx, command_word);

  SE_addParameter(se_cmd, message_size);

  SE_DataTransfer_t data_in = SE_DATATRANSFER_DEFAULT(message, message_size);
  SE_DataTransfer_t data_out = SE_DATATRANSFER_DEFAULT(digest, digest_size);

  SE_addDataInput(se_cmd, &data_in);
  SE_addDataOutput(se_cmd, &data_out);

  // Execute and wait
  return sli_se_execute_and_wait(cmd_ctx);
}

/** @} (end addtogroup sl_se) */

#endif // defined(SEMAILBOX_PRESENT)
